using System;

namespace LeetCode
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.ReadLine();
        }

        static bool IsPowerOfFour(int num)
        {
            /*
             * 小于等于 0，返回 false
             * 不是 2 的 N 次方的，返回 false 
             *  00000010 & 00000001 = 00000000 （2 & 1 == 0）
             *  00000011 & 00000010 = 00000010 （3 & 2 != 0）
             *  00000100 & 00000011 = 00000000 （4 & 3 == 0）
             * 不是 4 的 N 次方的，返回 false
             *  00000010 & 01010101 = 00000000 （2 & 0x5555 == 0）
             *  00000100 & 01010101 = 00000100 （4 & 0x5555 != 0）
             *  00000111 & 01010101 = 00000101 （7 & 0x5555 != 0）
             *  00001000 & 01010101 = 00000000 （8 & 0x5555 == 0）
             *  00010000 & 01010101 = 00010000 （16& 0x5555 != 0）
             * 
             * */

            return num > 0 && (num & (num - 1)) == 0 && (num & 0x55555555) != 0;
        }
    }
}
